In [1]:
import numpy as np
import pandas as pd
from datetime import datetime
import seaborn as sns
import matplotlib.pyplot as plt
import pandas_datareader as pdr
%matplotlib inline

In [2]:
tickers = pd.read_csv('NASDAQ100_short.csv', parse_dates=['from', 'to'])

In [3]:
tickers

  ticker       from         to
0    AAL 2014-12-22        NaT
1   ADCT        NaT 2003-12-22
2   ADBE        NaT        NaT
3   VMED 1998-12-21 2000-10-27
4   VMED 2004-12-20 2008-12-22
5   VMED 2009-12-21 2013-06-05

In [4]:
tickers['from'].fillna(datetime(1990,1,1), inplace=True)
tickers['to'].fillna(datetime(2017,6,1), inplace=True)

In [5]:
tickers

  ticker       from         to
0    AAL 2014-12-22 2017-06-01
1   ADCT 1990-01-01 2003-12-22
2   ADBE 1990-01-01 2017-06-01
3   VMED 1998-12-21 2000-10-27
4   VMED 2004-12-20 2008-12-22
5   VMED 2009-12-21 2013-06-05

# Random DF concat

5 dataframes, with 4 rows each, with 3 features

In [6]:
frames = [pd.DataFrame(np.random.randn(4,3), index=range(4)) for i in range(5)]

In [7]:
frames[0]

          0         1         2
0 -1.279166 -1.038439  1.061547
1 -1.009318  1.690118 -0.420239
2 -0.477596 -0.711004 -0.658232
3  0.446185  0.360166 -0.808002

In [8]:
subset = [frame.iloc[0:2] for frame in frames]
subset

[          0         1         2
 0 -1.279166 -1.038439  1.061547
 1 -1.009318  1.690118 -0.420239,           0         1         2
 0 -0.443331 -0.414796 -0.662091
 1  0.918358 -0.000544 -2.479280,           0         1         2
 0  0.788004  0.070953 -0.112422
 1  0.301025  0.469416 -1.247694,           0         1         2
 0 -1.861575  0.004277 -0.402271
 1  0.799242 -0.916789  0.660111,           0         1         2
 0 -0.995764 -1.392653 -0.218512
 1 -1.062843 -0.614435  1.387832]

In [9]:
np.concatenate(subset).shape

(10, 3)